"""Решение через словарь"""
seasons = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
a = int(input("Введите месяц в виде целого числа от 1 до 12: "))
print(seasons.get(a))

"""Решение через список"""
b = int(input("Введите месяц в виде целого числа от 1 до 12: "))
c = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
d = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
# e = c.index(b)
print(d[c.index(b)])
